month = int(input("Ввести число месяца: "))

dict_month = {12: 'зима', 1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето',
              9: 'осень', 10: 'осень', 11: 'осень'}
print('Это {} '.format(dict_month[month]))

list_month = [12, 'зима', 1, 'зима', 2, 'зима', 3, 'весна', 4, 'весна', 5, 'весна', 6, 'лето', 7, 'лето', 8, 'лето', 9,
              'осень', 10, 'осень', 11, 'осень']
season = list_month.index(month) + 1
print('Ура уже ' + list_month[season] + "!")
